Revit 2026 API

# BuiltInFailuresBlendFailures Class

---

Failures about Blend.

SystemObject Autodesk.Revit.DBBuiltInFailuresBlendFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class BlendFailures
```
```vb
Public NotInheritable Class BlendFailures
```
```cpp
public ref class BlendFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type BlendFailures = class end
```

The BuiltInFailuresBlendFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotDrawBlend | Can't create blend. |

#### Reference

Autodesk.Revit.DB Namespace